In [1]:
import pandas as pd
df = pd.read_csv('sal.csv')

In [2]:
df.head()

  company                  job     degree  salary>100k
0  google      sales executive  bachelors            0
1  google      sales executive    masters            0
2  google     business manager  bachelors            1
3  google     business manager    masters            1
4  google  computer programmer  bachelors            0

In [3]:
x = df.drop('salary>100k',axis='columns')
y = df['salary>100k']

In [4]:
x

       company                  job     degree
0       google      sales executive  bachelors
1       google      sales executive    masters
2       google     business manager  bachelors
3       google     business manager    masters
4       google  computer programmer  bachelors
5       google  computer programmer    masters
6   abc pharma      sales executive    masters
7   abc pharma  computer programmer  bachelors
8   abc pharma     business manager  bachelors
9   abc pharma     business manager    masters
10    facebook      sales executive  bachelors
11    facebook      sales executive    masters
12    facebook     business manager  bachelors
13    facebook     business manager    masters
14    facebook  computer programmer  bachelors
15    facebook  computer programmer    masters

In [5]:
y

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary>100k, dtype: int64

In [6]:
from sklearn.preprocessing import LabelEncoder

In [7]:
company_encoded = LabelEncoder()
job_encoded = LabelEncoder()
degree_encoded =LabelEncoder()

In [8]:
x['cmp'] = company_encoded.fit_transform(x['company'])
x['jb'] = job_encoded.fit_transform(x['job'])
x['deg'] = degree_encoded.fit_transform(x['degree'])

In [9]:
x.head()

  company                  job     degree  cmp  jb  deg
0  google      sales executive  bachelors    2   2    0
1  google      sales executive    masters    2   2    1
2  google     business manager  bachelors    2   0    0
3  google     business manager    masters    2   0    1
4  google  computer programmer  bachelors    2   1    0

In [10]:
x=x.drop(['company','job','degree'],axis='columns')

In [11]:
x

    cmp  jb  deg
0     2   2    0
1     2   2    1
2     2   0    0
3     2   0    1
4     2   1    0
5     2   1    1
6     0   2    1
7     0   1    0
8     0   0    0
9     0   0    1
10    1   2    0
11    1   2    1
12    1   0    0
13    1   0    1
14    1   1    0
15    1   1    1

In [12]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split

In [13]:
model = DecisionTreeClassifier()

In [14]:
model

DecisionTreeClassifier()

In [15]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=0)

In [16]:
x_train

    cmp  jb  deg
13    1   0    1
4     2   1    0
2     2   0    0
14    1   1    0
10    1   2    0
7     0   1    0
15    1   1    1
11    1   2    1
3     2   0    1
0     2   2    0
5     2   1    1
12    1   0    0

In [17]:
y_train

13    1
4     0
2     1
14    1
10    1
7     0
15    1
11    1
3     1
0     0
5     1
12    1
Name: salary>100k, dtype: int64

In [18]:
model.fit(x_train,y_train)

DecisionTreeClassifier()

In [19]:
model.score(x_test,y_test)

0.5

### Not a Good Model :(

In [20]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.3,random_state=0)

In [21]:
newmodel = DecisionTreeClassifier()

In [22]:
newmodel.fit(x_train,y_train)

DecisionTreeClassifier()

In [23]:
newmodel.score(x_test,y_test)

0.6

### Slightly  Better, Still a Bad Model :(